{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\Aakash\OneDrive\Desktop\Stata Lab record 2025\Task_9.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 9 Sep 2025, 14:14:14

{com}. sysuse nlsw88
{txt}(NLSW, 1988 extract)

{com}. tab race

       {txt}Race {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      White {c |}{res}      1,637       72.89       72.89
{txt}      Black {c |}{res}        583       25.96       98.84
{txt}      Other {c |}{res}         26        1.16      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,246      100.00

{com}. tab race,nolabel

       {txt}Race {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      1,637       72.89       72.89
{txt}          2 {c |}{res}        583       25.96       98.84
{txt}          3 {c |}{res}         26        1.16      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,246      100.00

{com}. gen white=1 if race==1
{txt}(609 missing values generated)

{com}. br race white

. replace white=0 if race==2
{txt}(583 real changes made)

{com}. br race white

. replace white=0 if race==3
{txt}(26 real changes made)

{com}. drop white

. gen white=1 if race==1
{txt}(609 missing values generated)

{com}. replace white=0 if white==1
{txt}(1,637 real changes made)

{com}. gen black=0 if race==2
{txt}(1,663 missing values generated)

{com}. replace black=0 if black==0
{txt}(0 real changes made)

{com}. replace black=0 if black==2
{txt}(0 real changes made)

{com}. replace black=0 if black==3
{txt}(0 real changes made)

{com}. replace black=0 if black==1
{txt}(0 real changes made)

{com}. tab white

      {txt}white {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,637      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,637      100.00

{com}. tab black

      {txt}black {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        583      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        583      100.00

{com}. gen new=age+race

. egen new1=mean(age)

. br age new1

. egen new2=max(age)

. br age new2

. br age white

. bys white:egen mean_age=mean age
{txt}{search r(198), local:r(198);}

{com}. bys white:egen mean_age=mean
{txt}{search r(198), local:r(198);}

{com}. bys white:egen mean_age=mean_age
{err}unknown {bf:egen} function {bf:mean_age()}
{txt}{search r(133), local:r(133);}

{com}. bys white:egen mean_age=mean(age)

. br age white mean_age

. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\Aakash\OneDrive\Desktop\Stata Lab record 2025\Task_9.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 9 Sep 2025, 14:22:33
{txt}{.-}
{smcl}
{txt}{sf}{ul off}